<template>
  <div>
    <h1>页面设计操作</h1>
    <el-divider></el-divider>
    <h2>总述</h2>
    <p>  通过【新增组件】按钮添加元素实现页面布局,左键点中组件会出现蓝色的边框，代表选中本组件，然后可以配置此组件的属性，
      【公共属性】【特有属性】【样式属性】，<span style="color:red">有些元素无法点中，比如【输入区域】，【按钮区域】</span>，
      点击只能选中最外层控件而无法选中 里面的输入元素，此时可以通过先点中选取 外层控件 然后在【子组件】中找到需要选中的组件，点
      【编辑】即可。
    </p>
    <p>
      通过【添加方法】可以给页面增加动作， 如查询数据，保存数据的方法，修改元素值，绑定值，显示状态的方法,此外还可以通过给
      组件添加事件实现组件之间的联动
    </p>
    <h2>一：新增组件</h2>
    <div>
      <p>作用：用于增加页面元素，实现业务功能，可以通过配置【公共属性】【样式属性】【特有属性】决定
        组件的具体功能
      </p>
      <h3>常用属性功能解释:</h3>
      <h3>1.公共属性</h3>
      <p>1.1 字段名: 组件唯一标志id，不可重复。在【方法】配置中需要用到。例如 id.value 即可获取到
        此id关联的组件的值（如果有的话：比如input，select组件）
      </p>
      <p>1.2 名称: 常用于可输入型组件，用于显示控件前缀
        <img src="../../imgs/1622178797.png" style="width: 100%"/>
      </p>
      <p>1.3 值: 改组件的值，可以用来给组件设置默认值
      </p>
      <p>
      <h3>类型:</h3>
      <h4>1.card: 一个矩形区域，默认背景白色，可以用来充当容器</h4>
      <img src="../../imgs/1622179325.png" style="width: 100%"/>
      <h4>2.标签页:字面意思</h4>
      <img src="../../imgs/1622179669.png" style="width: 100%"/>
      <h4>3.基本布局:</h4>
      <p>主要作用是实现页面布局，基于row，col的栅栏布局，一共有24格，可以通过改变col的特有属性跨列来调节宽度,如果row中的col的跨列值加起来
        大于24，改col会换行。一下为6,6,6,6
        <img src="../../imgs/1622180210.png" style="width: 100%"/>
      </p>
      <h4 style="color:red">4.输入区域:</h4>
      <p>一个有诸多表单输入组件组成的复杂控件，用于 【查询条件输入】 【编辑】等功能，类似于form表单控件，
        每一行也由24格栅栏组成
        <img src="../../imgs/1622180393.png" style="width: 100%"/>
      </p>
      <div style="text-indent: 2em">
        <h5>4.1特有属性</h5>
        <p>4.1.1 跨列，内部表单组件默认宽度，例如 【跨列】的值为4 则内部一行可存在 6(24/4)个表单元素</p>
        <p>4.1.2 显示前缀 规定默认是否显示表单元素的文字部分（就是前面的 【自定义：】 几个字）</p>
        <p>4.1.3 显示按钮 规定是否显示【查询】和【收起】按钮</p>
        <p>4.1.4 查询方法 点击 <span style="color:red">本组件自带的查询按钮</span> 时执行的方法</p>
        <h5>4.2 子组件</h5>
        <p>表单组件，用于输入，如input，select，date（日期），switch（开关），
          <span style="color:red">通过修改【特有属性】【组件类型】修改</span></p>
      </div>
      <h4>5.按钮区域: 一组按钮</h4>
      <h4 >6.表格：显示数据用,可以通过 字段名.data 给表格赋值</h4>
      <p><img src="../../imgs/1622182116.png" style="width: 100%"/></p>
      <div style="text-indent: 2em">
        <h5>6.1特有属性</h5>
        <p>4.1.1 显示列 规定显示哪些列，多个用逗号分割 如 name,value 显示 name 和 value 两列</p>
        <p>4.1.2 不显示列  规定不显示显示哪些列 用法同上</p>
        <p>4.1.3 列设置  每列的具体设置 可以设置 显示名称，宽度什么的(还没做完)</p>
      </div>
      <h4 >7.普通输入：一些可输入的表单组件</h4>
      <div style="text-indent: 2em">
        <p>7.1 select(下拉选择)： 绑定数据有两种方法: </p>
        <div style="text-indent: 2em">
          <p>1 点击【特有属性】【绑定数据】 然后输入见和值，注意保存时 要选择【保存为数组】</p>
          <p>2 执行方法，然后使用 字段名.bindData</p>
        </div>
        <p>7.2 日期 默认为今天， 可以通过设置【公共属性】【值】为【dateAdd:】调节日期 如 dateAdd:-1,month 会设置为一个月前</p>
      </div>
    </div>
    <h2>二：方法</h2>
    <div>
      <h3>1. 方法名称：用于标记方法id, 唯一，不可重复</h3>
      <h3>2.是否立即执行: 数字。如果填写代表会在页面加载完成自动执行，数字越大越晚执行，比如填写【2】的会等待【1】的方法
        全部执行完再执行，同一等级没有先后顺序
      </h3>
      <h3>3. 下一步：执行完本方法后执行的方法</h3>
      <h3>4.参数</h3>
      <p>用于ajax请求是携带的参数，左键会进入json编辑页面</p>
      <h3>5.方法类型</h3>
      <div style="text-indent: 2em">
        <h4  style="color:red"> 1.ajax</h4>
        <p>执行ajax请求， 需要跳鞋字段 【请求链接】，【目标字段】，</p>
        <p>【成功回调】：ajax请求成功是返回的方法</p>
        <p>【失败回调】：ajax请求失败是返回的方法</p>
        <p  style="color:red" v-html="`【参数】:分为value 和 label， value: 数据库中需要的参数名, label: 传入的值。允许两种方式: 
          常量和变量 如 abc 会将abc传入，而如果使用两个大括号{{}}包裹起来变成{{abc}}则会去取字段名为abc的组件的值，同时如果
          使用{{}}包裹，则内部可以使用js表达式 如 {{abc.join()}}`">
        </p>
        <h4  style="color:red">1.setValue</h4>
        <p>改变组件的状态和值</p>
        <p>【参数】:分为value 和 label        </p>
        <p>value: 需要改变的字段名 如 abc.value 会该表 abc组件的值。grid.data 会给表格赋值，select.bindData会改变下拉框的绑定值</p>
        <p>label: 同ajax，其中有几个常量 __JYRESULT 代表返回值, __hidParams 代表父组件传入</p>
        <h4>3.调用自定义方法：可以调用自己其他配置的方法</h4>
        <h4>4.showDialog：弹窗方法</h4>
        <h4>5.if：选择执行方法</h4>
        <h4>6.默认方法：选择方法名称调用默认提供的方法</h4>
      </div>
    </div>
  </div>
</template>
<script>
export default {
  
}
</script>